app/views/tweets/_who_to_follow.html.erb

      </div>
      <% @users = User.all %>
---
SELECT "users".* FROM "users"