app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY created_at, DESC
---
  def index
    @tweets = Tweet.all.order('created_at DESC')

INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweet", "happy birthday"], ["created_at", "2020-07-13 12:08:38.014738"], ["updated_at", "2020-07-13 12:08:38.014738"], ["user_id", 1]]
---
  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save

DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 1]]
---
  def destroy
    @tweet.destroy